NevynUK/Tab5Template/Examples/IMU/01-BasicReadings/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Chip revision: Tab5 uses ESP32-P4 silicon revision 0.x/1.x.
# Without ESP32P4_SELECTS_REV_LESS_V3, Kconfig only offers the {300,301} choice
# set and builds a bootloader that esptool refuses to flash on this chip.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# PSRAM — ESP32-P4 uses HEX PSRAM (not OCT); 200MHz required for MIPI-DSI framebuffer DMA
# CONFIG_SPIRAM_SPEED_200M depends on IDF_EXPERIMENTAL_FEATURES — both must be set together
# CONFIG_SPIRAM_MODE_HEX must be explicit: ESP32-P4 does not use OCT mode
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Partition table — 16MB flash requires a custom layout; default single-app gives only 1MB
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP Hosted — ESP32-C6 coprocessor connected to ESP32-P4 via SDIO (SDMMC slot 1)
#
# The SLAVE_IDF_TARGET_ESP32C6 symbol is owned by espressif/esp_wifi_remote.
# Setting it here causes "Wi-Fi Remote → Choose slave target" to select esp32c6,
# which in turn makes ESP_HOSTED_CP_TARGET_ESP32C6 visible in ESP-Hosted config.
#
# SDIO slot 1 is used because slot 0 on ESP32-P4 has IOMUX-fixed pins shared
# with the microSD card (CLK=43, CMD=44, D0=39…D3=42).
#
# Tab5 SDIO pin assignments (ESP32-P4 → ESP32-C6):
#   CLK=12  CMD=13  D0=11  D1=10  D2=9  D3=8  RESET=15
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
